{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"image:0": {"name": "image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"scores:0": {"name": "scores:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "151"}]}}}}}, "modelTopology": {"node": [{"name": "image", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}}, {"name": "mnas_v4_a_140_1/feature_network/feature_extractor/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "mnas_v4_a_140/output/fc/tf_layer/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}, {"size": "151"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140/output/fc/tf_layer/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "151"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "mnas_v4_a_140_1/feature_network/stem/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/stem/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "72"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_14/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1632"}, {"size": "1"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "72"}, {"size": "1"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "72"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_14/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1632"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "72"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "72"}, {"size": "24"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_14/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1632"}, {"size": "272"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_17/op_0/conv2d_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_14/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "272"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "72"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "72"}, {"size": "24"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "72"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_15/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "272"}, {"size": "1632"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "72"}, {"size": "1"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "72"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "56"}, {"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_15/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1632"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "168"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "168"}, {"size": "56"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "56"}, {"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_15/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1632"}, {"size": "1"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "168"}, {"size": "1"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "168"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_15/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1632"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "56"}, {"size": "336"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "336"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "336"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "336"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "336"}, {"size": "104"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_15/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1632"}, {"size": "272"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "104"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "104"}, {"size": "624"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "624"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_15/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "272"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "624"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "624"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "624"}, {"size": "104"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "104"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "104"}, {"size": "624"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "624"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_16/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "272"}, {"size": "1632"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "624"}, {"size": "1"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "624"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "624"}, {"size": "104"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "104"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_10/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "104"}, {"size": "624"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_16/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1632"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_10/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "624"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_10/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "624"}, {"size": "1"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_10/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "624"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_10/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "624"}, {"size": "136"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_10/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "136"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_11/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "136"}, {"size": "816"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_16/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1632"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_11/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "816"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_11/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "816"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_11/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "816"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_11/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "816"}, {"size": "136"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_16/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1632"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_11/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "136"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_12/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "136"}, {"size": "816"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_12/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "816"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_12/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "816"}, {"size": "1"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_12/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "816"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_12/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "816"}, {"size": "272"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_16/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1632"}, {"size": "448"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_12/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "272"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_13/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "272"}, {"size": "1632"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_13/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1632"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_16/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "448"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_13/op_0/depthwise_0/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1632"}, {"size": "1"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_13/op_0/depthwise_0/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1632"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_13/op_0/project_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1632"}, {"size": "272"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_13/op_0/project_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "272"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_14/op_0/expand_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "272"}, {"size": "1632"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_17/op_0/conv2d_0/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "448"}, {"size": "1280"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_14/op_0/expand_0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1632"}]}}}}}, {"name": "mnas_v4_a_140_1/feature_network/stem/bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["image", "mnas_v4_a_140_1/feature_network/stem/conv/Conv2D_weights", "mnas_v4_a_140_1/feature_network/stem/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/stem/bn/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/Relu", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_0/op_0/bn2_0/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/expand_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/expand_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/Relu", "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/op_0/Relu", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/bn2_0/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/cell_2/op_0/expand_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_2/op_0/expand_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/cell_2/op_0/Relu", "mnas_v4_a_140_1/feature_network/cell_2/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/cell_2/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_2/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/cell_2/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_2/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_2/output", "op": "Add", "input": ["mnas_v4_a_140_1/feature_network/cell_2/op_0/bn2_0/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/lead_cell_1/op_0/bn2_0/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/op_0/Relu", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_2/output", "mnas_v4_a_140_1/feature_network/cell_3/op_0/expand_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_3/op_0/expand_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/cell_3/op_0/Relu", "mnas_v4_a_140_1/feature_network/cell_3/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/cell_3/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_3/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/cell_3/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_3/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_3/output", "op": "Add", "input": ["mnas_v4_a_140_1/feature_network/cell_3/op_0/bn2_0/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/cell_2/output"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/Relu", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_3/output", "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/expand_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/expand_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/Relu", "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/op_0/Relu", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/bn2_0/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/cell_5/op_0/expand_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_5/op_0/expand_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/cell_5/op_0/Relu", "mnas_v4_a_140_1/feature_network/cell_5/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/cell_5/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_5/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/cell_5/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_5/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_5/output", "op": "Add", "input": ["mnas_v4_a_140_1/feature_network/cell_5/op_0/bn2_0/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/lead_cell_4/op_0/bn2_0/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/op_0/Relu", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_5/output", "mnas_v4_a_140_1/feature_network/cell_6/op_0/expand_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_6/op_0/expand_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/cell_6/op_0/Relu", "mnas_v4_a_140_1/feature_network/cell_6/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/cell_6/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_6/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/cell_6/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_6/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_6/output", "op": "Add", "input": ["mnas_v4_a_140_1/feature_network/cell_6/op_0/bn2_0/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/cell_5/output"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/Relu", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_6/output", "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/expand_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/expand_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/Relu", "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/op_0/Relu", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/bn2_0/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/cell_8/op_0/expand_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_8/op_0/expand_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/cell_8/op_0/Relu", "mnas_v4_a_140_1/feature_network/cell_8/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/cell_8/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_8/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/cell_8/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_8/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_8/output", "op": "Add", "input": ["mnas_v4_a_140_1/feature_network/cell_8/op_0/bn2_0/FusedBatchNormV3", "mnas_v4_a_140_1/feature_network/lead_cell_7/op_0/bn2_0/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/op_0/Relu", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_8/output", "mnas_v4_a_140_1/feature_network/cell_9/op_0/expand_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_9/op_0/expand_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/op_0/depthwise_0/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["mnas_v4_a_140_1/feature_network/cell_9/op_0/Relu", "mnas_v4_a_140_1/feature_network/cell_9/op_0/depthwise_0/depthwise_weights", "mnas_v4_a_140_1/feature_network/cell_9/op_0/depthwise_0/depthwise_bn_offset"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/op_0/bn2_0/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["mnas_v4_a_140_1/feature_network/cell_9/op_0/depthwise_0/depthwise", "mnas_v4_a_140_1/feature_network/cell_9/op_0/project_0/Conv2D_weights", "mnas_v4_a_140_1/feature_network/cell_9/op_0/project_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "mnas_v4_a_140_1/feature_network/cell_9/output", "op": "Add", "input": 